a2 = "Α"; a1 = "А";
pass = "";
line = "ΑАΑАΑΑААΑААΑААААΑААΑААΑАΑААΑΑАΑАΑАААΑАΑΑΑААΑАΑΑАΑААΑААΑАΑААΑΑАΑАΑАААΑΑААΑΑАΑΑΑΑΑΑАААΑАΑΑΑААΑАΑΑΑΑААΑАΑΑАΑААΑАААΑΑААΑΑАААΑАААΑΑААΑΑАΑΑΑΑΑΑААΑΑАААΑААΑΑАΑАΑАААΑАΑΑΑΑАΑΑΑΑΑΑААΑАААΑΑААΑΑАΑАΑААΑΑАΑАΑААΑΑАΑΑΑААΑААΑΑΑААΑΑАΑАΑАААΑΑААΑАААΑΑААΑААΑААΑΑΑААААΑΑАΑΑАΑΑΑΑΑΑАΑАΑАΑАΑААΑАААΑΑΑААΑΑΑАΑААΑΑΑААΑΑААΑΑΑΑΑААΑΑАΑΑΑΑААΑΑААΑААΑΑАΑΑ";

for (vuelta=0; vuelta<line.length/8; vuelta++){
msg = ""; 

for(i=vuelta*8; i < (vuelta*8+8); i++){
 if(line.charAt(i) == a1) {
       msg += "1"; 
 } else { 
        msg += "0";
 }
}

pass += String.fromCharCode(parseInt(msg,2));
}

console.log(pass);
